app/controllers/courrier_controller.rb

    def index
        @progress = Progress.all
        @user = User.find(session[:user_id])
        myorders = @user.deliveries
        @myorders = myorders.where("step < ?", 5)
        @orders = Order.where(step: nil, paid: true)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."step" IS NULL AND "orders"."paid" = $1  [["paid", "t"]]

    def claim
        @order = Order.find(params[:id])
        if @order.delivered_by.empty?
            @order.step = 1
            @order.save
            @courier = Courier.new
            @courier.user_id = User.find(session[:user_id]).id
            @courier.order_id = @order.id
            @courier.save
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "orders" SET "step" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["step", 1], ["updated_at", "2019-10-24 17:29:17.385992"], ["id", 4]]
SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "couriers" ("user_id", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["order_id", 4], ["created_at", "2019-10-24 16:02:19.516668"], ["updated_at", "2019-10-24 16:02:19.516668"]]

    def update
        @order = Order.find(params[:id])
        @order.step += 1
        @order.save
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "orders" SET "step" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["step", 2], ["updated_at", "2019-10-24 17:48:39.434000"], ["id", 4]]

    def login
        @user = User.find(session[:user_id])
        @user.is_online = true
        @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "is_online" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["is_online", "t"], ["updated_at", "2019-10-24 18:55:13.364461"], ["id", 1]]

    def logoff
        @user = User.find(session[:user_id])
        @user.is_online = false
        @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "is_online" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["is_online", "f"], ["updated_at", "2019-10-24 18:55:11.151942"], ["id", 1]]