app/controllers/orders_controller.rb

SELECT "users".* FROM "users" WHERE "users"."is_courier" = $1 AND "users"."is_online" = $2  [["is_courier", "t"], ["is_online", "t"]]
---
    def index
        data = File.read("#{Rails.root}/public/response.json")
        @data = JSON.parse(data).with_indifferent_access
        @businesses = @data["businesses"]
        @couriers_online = User.where(is_courier:true,is_online:true)

INSERT INTO "orders" ("pulocation", "puname", "putime", "puaddress", "puzipcode", "doaddress", "dozipcode", "notes", "tip", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "orders" SET "updated_at" = $1, "stripe_id" = $2 WHERE "orders"."id" = $3  [["updated_at", "2019-10-24 17:16:18.161876"], ["stripe_id", "cs_test_0eQRyvVJOIqG52P20KB6CGBt0X3OuSKnT9XfpmSqW3rMYalYSwMBybv5"], ["id", 3]]
---
    def checkout
        @order = Order.create(order_params)
        @order.user = User.find(session[:user_id])
        @order.save

SELECT  "orders".* FROM "orders" WHERE "orders"."stripe_id" = $1 LIMIT $2  [["stripe_id", "cs_test_pDjuodw6G2jzMrRc6rx2sh60RPJY69uhJ4YS8VuqcnCYImfLDZVnqy42"], ["LIMIT", 1]]
UPDATE "orders" SET "paid" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["paid", "t"], ["updated_at", "2019-10-23 22:12:37.706679"], ["id", 4]]
---
    def success
        @order = Order.find_by stripe_id:params[:session_id]
        @order.paid = true
        @order.save